In [2]:
import pandas as pd
from sqlalchemy import create_engine, inspect

In [3]:
#store csv file into dataframe and view header of file
csv_file1 = "Data/ASGARD - Global-Artificial-Intelligence-Database-2018.csv"
aidb_data_df = pd.read_csv(csv_file1)
aidb_data_df.head()

,Country,State,City,Name,Category - Final,Description,Website
0,United States,�New York,New York,*gram Labs,Core AI,"GramLabs is a start up, leveraging deep learni...",http://gramlabs.ai/
1,Germany,NaN,Berlin,12k Research,Business Intelligence,NaN,https://12k.co
2,Israel,�HaMerkaz,Savyon,12mass,Communication,12Mass (formerly itweetlive) makes it possible...,http://12mass.com
3,China,NaN,Beijing,12SIGMA,Healthcare,12SIGMA is a biotechnology company that integr...,http://www.12sigma.cn
4,United States,�Maryland,Germantown,133T.,Human Resources,"133T, (LEET), provides an automated, streamlin...",http://www.133t.com

In [4]:
##  Rename the column headers
aidb_data_df = aidb_data_df.rename(columns={"Category - Final": "Category"})
idb_data_df = aidb_data_df.rename(columns={"Name": "Company_Name"})
# Selecting the desired Columns
Caidb_data_df = aidb_data_df[["Country", "City", "Name", "Category", "Website"]]
#Droping the NaN values in coutnry column
Caidb_data_df = Caidb_data_df.dropna(subset=['Country'])
Caidb_data_df.set_index("Country", inplace=True)
Caidb_data_df.head()

,City,Name,Category,Website
Country,,,,
United States,New York,*gram Labs,Core AI,http://gramlabs.ai/
Germany,Berlin,12k Research,Business Intelligence,https://12k.co
Israel,Savyon,12mass,Communication,http://12mass.com
China,Beijing,12SIGMA,Healthcare,http://www.12sigma.cn
United States,Germantown,133T.,Human Resources,http://www.133t.com

In [5]:
# Cleaning the df to remove * . 
Caidb_data_df.Name = Caidb_data_df.Name.str.replace('*', '')
Caidb_data_df.Name = Caidb_data_df.Name.str.replace('.', '')
Caidb_data_df.head()

<ipython-input-5-0b7ce90e2415>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  Caidb_data_df.Name = Caidb_data_df.Name.str.replace('*', '')
<ipython-input-5-0b7ce90e2415>:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  Caidb_data_df.Name = Caidb_data_df.Name.str.replace('.', '')

,City,Name,Category,Website
Country,,,,
United States,New York,gram Labs,Core AI,http://gramlabs.ai/
Germany,Berlin,12k Research,Business Intelligence,https://12k.co
Israel,Savyon,12mass,Communication,http://12mass.com
China,Beijing,12SIGMA,Healthcare,http://www.12sigma.cn
United States,Germantown,133T,Human Resources,http://www.133t.com

In [6]:
Caidb_data_df.dtypes

City        object
Name        object
Category    object
Website     object
dtype: object

In [7]:
#store csv file into dataframe and view header of file
csv_file2 = "Data/Tech_Companies_Deals.csv"
tcd_data_df = pd.read_csv(csv_file2)
tcd_data_df.head()

,Country,Company_Count,Deal_Count,Capital_Invested,Capital_Invested_M,Revenue,Revenue_Max,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,United States,"71,150","181,524.00","3,832,098.10",1.48,12.22,"339,270.00",NaN,NaN,NaN
1,United Kingdom,"12,243","25,896.00","416,953.61",0.85,5.39,"9,591.12",NaN,NaN,NaN
2,Canada,"6,498","14,939","104,214.39",0.79,2.53,"6,245.08",NaN,NaN,NaN
3,Afghanistan,2,3,-,-,-,-,NaN,NaN,NaN
4,Albania,2,3,-,-,-,-,NaN,NaN,NaN

In [8]:

# Selecting the desired Columns
Ctcd_data_df = tcd_data_df[["Country", "Company_Count", "Deal_Count", "Capital_Invested", "Revenue_Max"]]
##  Rename the column headers
Ctcd_data_df = Ctcd_data_df.rename(columns={"Revenue_Max": "Revenue"})
#Droping the NaN values in coutnry column
Ctcd_data_df = Ctcd_data_df.dropna(subset=['Country'])
Ctcd_data_df.set_index("Country", inplace=True)
Ctcd_data_df.head()

               Company_Count  Deal_Count Capital_Invested     Revenue
Country
United States         71,150  181,524.00     3,832,098.10  339,270.00
United Kingdom        12,243   25,896.00       416,953.61    9,591.12
Canada                 6,498      14,939       104,214.39    6,245.08
Afghanistan                2           3                -           -
Albania                    2           3                -           -

In [9]:
#Cleaning the data by removing , -
Ctcd_data_df.Company_Count = Ctcd_data_df.Company_Count.str.replace(',', '')
Ctcd_data_df.Deal_Count = Ctcd_data_df.Deal_Count.str.replace(',', '')
Ctcd_data_df.Capital_Invested = Ctcd_data_df.Capital_Invested.str.replace(',', '')
Ctcd_data_df.Capital_Invested = Ctcd_data_df.Capital_Invested.str.replace('-', '0')
Ctcd_data_df.Revenue = Ctcd_data_df.Revenue.str.replace(',', '')
Ctcd_data_df.Revenue = Ctcd_data_df.Revenue.str.replace('-', '0')

In [10]:
Ctcd_data_df.head()

               Company_Count Deal_Count Capital_Invested    Revenue
Country
United States          71150  181524.00       3832098.10  339270.00
United Kingdom         12243   25896.00        416953.61    9591.12
Canada                  6498      14939        104214.39    6245.08
Afghanistan                2          3                0          0
Albania                    2          3                0          0

In [11]:
#Converting data types into integers
Ctcd_data_df["Company_Count"] = Ctcd_data_df.loc[:, ["Company_Count"]].astype(int)
Ctcd_data_df["Deal_Count"] = Ctcd_data_df.loc[:, ["Deal_Count"]].astype(float)
Ctcd_data_df["Deal_Count"] = Ctcd_data_df.loc[:, ["Deal_Count"]].astype(int)
Ctcd_data_df["Capital_Invested"] = Ctcd_data_df.loc[:, ["Capital_Invested"]].astype(float)
Ctcd_data_df["Capital_Invested"] = Ctcd_data_df.loc[:, ["Capital_Invested"]].astype(int)
Ctcd_data_df["Revenue"] = Ctcd_data_df.loc[:, ["Revenue"]].astype(float)
Ctcd_data_df["Revenue"] = Ctcd_data_df.loc[:, ["Revenue"]].astype(int)
Ctcd_data_df.head()

                Company_Count  Deal_Count  Capital_Invested  Revenue
Country
United States           71150      181524           3832098   339270
United Kingdom          12243       25896            416953     9591
Canada                   6498       14939            104214     6245
Afghanistan                 2           3                 0        0
Albania                     2           3                 0        0

In [12]:
Ctcd_data_df.dtypes

Company_Count       int64
Deal_Count          int64
Capital_Invested    int64
Revenue             int64
dtype: object

In [13]:
Company_tcd = Ctcd_data_df.sort_values(["Company_Count"], ascending = False)
Company_tcd.head()

                Company_Count  Deal_Count  Capital_Invested  Revenue
Country
United States           71150      181524           3832098   339270
United Kingdom          12243       25896            416953     9591
Canada                   6498       14939            104214     6245
France                   6483       12998            163190    99390
Germany                  5647       11330            343834    47421

In [14]:
Deal_tcd = Ctcd_data_df.sort_values(["Deal_Count"], ascending = False)
Deal_tcd.head()

                Company_Count  Deal_Count  Capital_Invested  Revenue
Country
United States           71150      181524           3832098   339270
United Kingdom          12243       25896            416953     9591
Canada                   6498       14939            104214     6245
France                   6483       12998            163190    99390
Germany                  5647       11330            343834    47421

In [15]:
Cap_tcd = Ctcd_data_df.sort_values(["Capital_Invested"], ascending = False)
Cap_tcd.head()

                Company_Count  Deal_Count  Capital_Invested  Revenue
Country
United States           71150      181524           3832098   339270
China                    3955        8395            564413    66859
United Kingdom          12243       25896            416953     9591
Germany                  5647       11330            343834    47421
India                    4608       10340            214212    14359

In [16]:
Rev_tcd = Ctcd_data_df.sort_values(["Revenue"], ascending = False)
Rev_tcd.head()

               Company_Count  Deal_Count  Capital_Invested  Revenue
Country
United States          71150      181524           3832098   339270
South Korea             1076        2132             49171   166264
Spain                   2633        5242             87265   130251
France                  6483       12998            163190    99390
China                   3955        8395            564413    66859

In [22]:
#store csv file into dataframe and view header of file
csv_file3 = "Data/AI Companies_Deals.csv"
aicd_data_df = pd.read_csv(csv_file3)
aicd_data_df.head()

,Countries,Company Count,Deal Count,Capital Invested,Capital Invested Median,Revenue Median,Revenue Max,Pre-money Valuation Median,% Acquired Median,Post Valuation Median
0,United States,"2,812","7,658","81,316.15",1.37,6.65,"8,756.53",7.8,23.80%,11.31
1,United Kingdom,478,"1,179","2,946.92",0.5,1.14,435.01,1.64,19.00%,2.2
2,Canada,282,870,"1,203.96",0.54,0.89,93.36,1.79,25.30%,1.97
3,Argentina,5,14,4.78,0.03,-,-,0.75,-,-
4,Australia,65,139,230.61,0.16,11.47,96.6,0.55,8.00%,0.59

In [27]:
# Selecting the desired Columns
Caicd_data_df = aicd_data_df[["Countries", "Company Count", "Deal Count", "Capital Invested", "Revenue Max"]]
#Ctcd_data_df = tcd_data_df[["Country", "Company_Count", "Deal_Count", "Capital_Invested", "Revenue_Max"]]
##  Rename the column headers
Caicd_data_df = Caicd_data_df.rename(columns={"Revenue Max": "Revenue", "Countries":"Country", "Company Count":"Company_Count","Deal Count":"Deal_Count","Revenue Max":"Revenue","Capital Invested":"Capital_Invested"})

#Droping the NaN values in coutnry column
Caicd_data_df = Caicd_data_df.dropna(subset=['Country'])
Caicd_data_df.set_index("Country", inplace=True)
Caicd_data_df.head()

               Company_Count Deal_Count Capital_Invested   Revenue
Country
United States          2,812      7,658        81,316.15  8,756.53
United Kingdom           478      1,179         2,946.92    435.01
Canada                   282        870         1,203.96     93.36
Argentina                  5         14             4.78         -
Australia                 65        139           230.61      96.6

In [28]:
#Cleaning the data by removing , -
Caicd_data_df.Company_Count = Caicd_data_df.Company_Count.str.replace(',', '')
Caicd_data_df.Deal_Count = Caicd_data_df.Deal_Count.str.replace(',', '')
Caicd_data_df.Capital_Invested = Caicd_data_df.Capital_Invested.str.replace(',', '')
Caicd_data_df.Capital_Invested = Caicd_data_df.Capital_Invested.str.replace('-', '0')
Caicd_data_df.Revenue = Caicd_data_df.Revenue.str.replace(',', '')
Caicd_data_df.Revenue = Caicd_data_df.Revenue.str.replace('-', '0')

In [29]:
Caicd_data_df.head()

               Company_Count Deal_Count Capital_Invested  Revenue
Country
United States           2812       7658         81316.15  8756.53
United Kingdom           478       1179          2946.92   435.01
Canada                   282        870          1203.96    93.36
Argentina                  5         14             4.78        0
Australia                 65        139           230.61     96.6

In [30]:
#Converting data types into integers
Caicd_data_df["Company_Count"] = Caicd_data_df.loc[:, ["Company_Count"]].astype(int)
Caicd_data_df["Deal_Count"] = Caicd_data_df.loc[:, ["Deal_Count"]].astype(float)
Caicd_data_df["Deal_Count"] = Caicd_data_df.loc[:, ["Deal_Count"]].astype(int)
Caicd_data_df["Capital_Invested"] = Caicd_data_df.loc[:, ["Capital_Invested"]].astype(float)
Caicd_data_df["Capital_Invested"] = Caicd_data_df.loc[:, ["Capital_Invested"]].astype(int)
Caicd_data_df["Revenue"] = Caicd_data_df.loc[:, ["Revenue"]].astype(float)
Caicd_data_df["Revenue"] = Caicd_data_df.loc[:, ["Revenue"]].astype(int)
Caicd_data_df.head()

                Company_Count  Deal_Count  Capital_Invested  Revenue
Country
United States            2812        7658             81316     8756
United Kingdom            478        1179              2946      435
Canada                    282         870              1203       93
Argentina                   5          14                 4        0
Australia                  65         139               230       96

In [31]:
Caicd_data_df.dtypes

Company_Count       int64
Deal_Count          int64
Capital_Invested    int64
Revenue             int64
dtype: object

In [17]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /Users/admin/opt/anaconda3/lib/python3.8/site-packages (2.8.6)
Note: you may need to restart the kernel to use updated packages.

In [39]:
#  create database connection
connection_string = "postgres:nopass97@localhost:5432/Project"
engine = create_engine(f'postgresql://{connection_string}')

In [ ]:
# Create the inspector and connect it to the engine
#inspector = inspect(engine)

In [40]:
# Confirm tables
engine.table_names()

['tech_companies_deals', 'aidb']

In [41]:
Caidb_data_df.to_sql(name='aidb', con=engine, if_exists='replace', index=True)

In [42]:
Ctcd_data_df.to_sql(name='tech_companies_deals', con=engine, if_exists='replace', index=True)

In [ ]:
#Company_tcd.to_sql(name='TCD_Company', con=engine, if_exists='replace', index=True)

In [ ]:
#Deal_tcd.to_sql(name='TCD_Deals', con=engine, if_exists='replace', index=True)

In [ ]:
#Cap_tcd.to_sql(name='TCD_Capital', con=engine, if_exists='replace', index=True)

In [ ]:
#Rev_tcd.to_sql(name='TCD_Revenue', con=engine, if_exists='replace', index=True)